repro/runs/run_cfd/cfd/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{ version 2.0; format ascii; class dictionary; object blockMeshDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;
vertices
(
    (0        0    0)
    (0.7066 0    0)
    (0.7066 2.0 0)
    (0        2.0  0)
    (0        0    0.1)
    (0.7066 0    0.1)
    (0.7066 2.0 0.1)
    (0        2.0  0.1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (24 80 1) simpleGrading (1 1 1) );
edges ();
boundary
(
    plate
    { type wall; inGroups (viewFactorWall); faces ( (0 4 7 3) ); }
    riser
    { type wall; inGroups (viewFactorWall); faces ( (1 2 6 5) ); }
    adiabatic
    { type wall; inGroups (viewFactorWall); faces ( (0 1 5 4) (3 7 6 2) ); }
    frontBack
    { type empty; faces ( (0 3 2 1) (4 5 6 7) ); }
);
mergePatchPairs ();
