repro/runs/run_cfd/cfd/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    plate
    {
        type            wall;
        inGroups        2(viewFactorWall wall);
        nFaces          80;
        startFace       3736;
    }
    riser
    {
        type            wall;
        inGroups        2(viewFactorWall wall);
        nFaces          80;
        startFace       3816;
    }
    adiabatic
    {
        type            wall;
        inGroups        2(viewFactorWall wall);
        nFaces          48;
        startFace       3896;
    }
    frontBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3840;
        startFace       3944;
    }
)

// ************************************************************************* //
