repro/runs/run_cfd/cfd/constant/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{ version 2.0; format ascii; class dictionary; object viewFactorsDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

writeViewFactorMatrix   true;
writePatchViewFactors   false;
writeFacesAgglomeration true;
patchAgglomeration
{
    viewFactorWall
    {
        nFacesInCoarsestLevel 20;
        featureAngle          10;
    }
}
maxDynListLength 200000;
