repro/runs/run_cfd/cfd/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{ version 2.0; format ascii; class volScalarField; object p_rgh; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
    plate     { type fixedFluxPressure; value uniform 101325; }
    riser     { type fixedFluxPressure; value uniform 101325; }
    adiabatic { type fixedFluxPressure; value uniform 101325; }
    frontBack { type empty; }
}
