repro/runs/run_cfd/cfd/0/viewFactorField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      viewFactorField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    plate
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.8809225
0.8809225
0.8809225
0.8809225
1.03228
1.03228
1.03228
1.03228
...
)
;
    }
    riser
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.8563643
0.8563643
0.8563643
0.8563643
1.013961
1.013961
1.013961
1.013961
...
)
;
    }
    adiabatic
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
0.9537099
0.9537099
0.9537099
0.9537099
0.9835452
0.9835452
0.9835452
0.9835452
...
)
;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
